source/3_Lesson.org
#+STARTUP:indent
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/styles.css"/>
#+HTML_HEAD_EXTRA: <link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
#+HTML_HEAD_EXTRA: <script src="http://ajax.googleapis.com/ajax/libs/jquery/1.9.1/jquery.min.js" type="text/javascript"></script>
#+HTML_HEAD_EXTRA: <script src="js/navbar.js" type="text/javascript"></script>
#+OPTIONS: f:nil author:nil num:1 creator:nil timestamp:nil toc:nil html-style:nil

#+TITLE: Artificial Intelligence
#+AUTHOR: Marc Scott, updated by Xiaohui Ellis

#+BEGIN_EXPORT html
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/stsb11/8-CS-AI">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li>
      <li><a href="5_Lesson.html">Week5</a></li>
      <li><a href="Homework.html">Homework</a></li>
      <li><a href="assessment.html">Assessment</a></li>

    </ul>
  </div>

<div id="underlay" onclick="underlayoff()">
</div>
<div id="overlay" onclick="overlayoff()">
</div>
<div id=overlayMenu>
<p onclick="overlayon('hsla(0, 0%, 50%, 0.5)')">Grey overlay</p>
<p onclick="underlayon('hsla(300,100%,50%, 0.3)')">Pink</p>
<p onclick="underlayon('hsla(80, 90%, 40%, 0.4)')">Green</p>
<p onclick="underlayon('hsla(240,100%,50%,0.2)')">Blue</p>
<p onclick="underlayon('hsla(40,100%,50%,0.3)')">Cream</p>
<p onclick="underlayon('hsla(300,100%,40%,0.3)')">Liliac</p>
<p onclick="underlayon('hsla(300,100%,25%,0.3)')">Purple</p>
<p onclick="underlayon('hsla(60,100%,50%,0.3)')">Yellow</p>
</div>
#+END_EXPORT
* COMMENT Use as a template
:PROPERTIES:
:HTML_CONTAINER_CLASS: activity
:END:
** Learn It
:PROPERTIES:
:HTML_CONTAINER_CLASS: learn
:END:

** Research It
:PROPERTIES:
:HTML_CONTAINER_CLASS: research
:END:

** Design It
:PROPERTIES:
:HTML_CONTAINER_CLASS: design
:END:

** Build It
:PROPERTIES:
:HTML_CONTAINER_CLASS: build
:END:

** Test It
:PROPERTIES:
:HTML_CONTAINER_CLASS: test
:END:

** Run It
:PROPERTIES:
:HTML_CONTAINER_CLASS: run
:END:

** Document It
:PROPERTIES:
:HTML_CONTAINER_CLASS: document
:END:

** Code It
:PROPERTIES:
:HTML_CONTAINER_CLASS: code
:END:

** Program It
:PROPERTIES:
:HTML_CONTAINER_CLASS: program
:END:

** Try It
:PROPERTIES:
:HTML_CONTAINER_CLASS: try
:END:

** Badge It
:PROPERTIES:
:HTML_CONTAINER_CLASS: badge
:END:

** Save It
:PROPERTIES:
:HTML_CONTAINER_CLASS: save
:END:

* AI in our lives
:PROPERTIES:
:HTML_CONTAINER_CLASS: activity
:END:
** Research It
:PROPERTIES:
:HTML_CONTAINER_CLASS: research
:END:
- There are many AI technologies currently in use.
- Some of these include:
  - Siri
  - Alexa
  - ASIMO
  - Self-driving cars
  - IBM Watson
  - The Mars Rover
  - [[https://www.captionbot.ai][Caption Bot]] 
  - [[https://research.google.com/semantris/][Semantris]]
- But this list is far from exhausitve.



** Badge It -  Current Development and Ethics of AI Group Project
:PROPERTIES:
:HTML_CONTAINER_CLASS: badge
:END:
- *Green pen Matters*
 
*** For this activity you need to work in a group 2-3 to produce a final presentation. The process is as following:
 
  - Pick one current AI technology (see the list for suggestions below)
  - Answer the default set of questions
  - Pick three questions, two if only two members in a team from a given list as your project focus. 
  - Work out who is responsible for which questions in your team
  - Brain storm and pick a presentation format to present your work
  - Decide who is going to present to the whole group upon finish
*** Organise your project
- Use [[./doc/AI-Group-Project.docx][this project booklet]] to organise your team and your work
- Using those two articles to get some ideas:
  1. Here is an [[http://beebom.com/2015/12/examples-of-artificial-intelligence][article]].
  2. Here is another [[https://emerj.com/ai-sector-overviews/everyday-examples-of-ai/][article]] 
*** Assessment of your team work
- Your team work will be awarded Silver, Gold or Platinum badges depending on the overall quality of your work.
