pages/3_Lesson.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Artificial Intelligence</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Artificial Intelligence</h1>
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/stsb11/8-CS-AI">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li>
      <li><a href="5_Lesson.html">Week5</a></li>
      <li><a href="Homework.html">Homework</a></li>
      <li><a href="assessment.html">Assessment</a></li>

    </ul>
  </div>

<div id="underlay" onclick="underlayoff()">
</div>
<div id="overlay" onclick="overlayoff()">
</div>
<div id=overlayMenu>
<p onclick="overlayon('hsla(0, 0%, 50%, 0.5)')">Grey overlay</p>
<p onclick="underlayon('hsla(300,100%,50%, 0.3)')">Pink</p>
<p onclick="underlayon('hsla(80, 90%, 40%, 0.4)')">Green</p>
<p onclick="underlayon('hsla(240,100%,50%,0.2)')">Blue</p>
<p onclick="underlayon('hsla(40,100%,50%,0.3)')">Cream</p>
<p onclick="underlayon('hsla(300,100%,40%,0.3)')">Liliac</p>
<p onclick="underlayon('hsla(300,100%,25%,0.3)')">Purple</p>
<p onclick="underlayon('hsla(60,100%,50%,0.3)')">Yellow</p>
</div>
<div id="outline-container-orgd6c2cc0" class="outline-2 activity">
<h2 id="orgd6c2cc0"><span class="section-number-2">1</span> AI in our lives</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgdbb923d" class="outline-3 research">
<h3 id="orgdbb923d">Research It</h3>
<div class="outline-text-3" id="text-orgdbb923d">
<ul class="org-ul">
<li>There are many AI technologies currently in use.</li>
<li>Some of these include:
<ul class="org-ul">
<li>Siri</li>
<li>Alexa</li>
<li>ASIMO</li>
<li>Self-driving cars</li>
<li>IBM Watson</li>
<li>The Mars Rover</li>
<li><a href="https://www.captionbot.ai">Caption Bot</a></li>
<li><a href="https://research.google.com/semantris/">Semantris</a></li>
</ul></li>
<li>But this list is far from exhausitve.</li>
</ul>
</div>
</div>



<div id="outline-container-org69dfdb8" class="outline-3 badge">
<h3 id="org69dfdb8">Badge It -  Current Development and Ethics of AI Group Project</h3>
<div class="outline-text-3" id="text-org69dfdb8">
<ul class="org-ul">
<li><b>Green pen Matters</b></li>
</ul>
</div>

<div id="outline-container-orgd6e8f5a" class="outline-4">
<h4 id="orgd6e8f5a">For this activity you need to work in a group 2-3 to produce a final presentation. The process is as following:</h4>
<div class="outline-text-4" id="text-orgd6e8f5a">
<ul class="org-ul">
<li>Pick one current AI technology (see the list for suggestions below)</li>
<li>Answer the default set of questions</li>
<li>Pick three questions, two if only two members in a team from a given list as your project focus.</li>
<li>Work out who is responsible for which questions in your team</li>
<li>Brain storm and pick a presentation format to present your work</li>
<li>Decide who is going to present to the whole group upon finish</li>
</ul>
</div>
</div>
<div id="outline-container-orga9e10b6" class="outline-4">
<h4 id="orga9e10b6">Organise your project</h4>
<div class="outline-text-4" id="text-orga9e10b6">
<ul class="org-ul">
<li>Use <a href="./doc/AI-Group-Project.docx">this project booklet</a> to organise your team and your work</li>
<li>Using those two articles to get some ideas:
<ol class="org-ol">
<li>Here is an <a href="http://beebom.com/2015/12/examples-of-artificial-intelligence">article</a>.</li>
<li>Here is another <a href="https://emerj.com/ai-sector-overviews/everyday-examples-of-ai/">article</a></li>
</ol></li>
</ul>
</div>
</div>
<div id="outline-container-org50b7abc" class="outline-4">
<h4 id="org50b7abc">Assessment of your team work</h4>
<div class="outline-text-4" id="text-org50b7abc">
<ul class="org-ul">
<li>Your team work will be awarded Silver, Gold or Platinum badges depending on the overall quality of your work.</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
